In [1]:
#Pandas:- Used to read external files and load the data into table like struc. in RAM (DataFrame). It is used for analytics
#Dataframe:-Simillar like table having rows and columns. Made of 3 parts 1:-col. names(Mand.) 2:-def. indexes(Opt.) 3:-Data (mand.)

In [2]:
# Methods toCreate Dataframe:-

In [3]:
import pandas as pd
import numpy as np

In [4]:
d = np.random.randint(1,11,(5,3))
c = ['Col1', 'Col2', 'Col3']
i = ['A', 'B', 'C', 'D', 'E']
d1 ={'Roll': [1,2,3,4,5],
     'Name': ['ABC', 'EFG', 'LMN', 'PQR', 'XYZ'],
     'Marks': [72, 68, 55, 87, 79],
     'Address': ['Pune', 'Mumbai', 'Nashik', 'Solapur', 'Parbhani']}

In [5]:
df1 = pd.DataFrame(data=d, columns=c) #1st way to create DF. Dataframe of same data type, Has Columns as well, Only 2D data
df1

   Col1  Col2  Col3
0     7     3     6
1     4     9    10
2     7     8     3
3     7     3     3
4     4     2     5

In [6]:
df2 = pd.DataFrame(d1) # 2nd way is to pass dictionary to dataframe. Dataframe of different data type
df2

   Roll Name  Marks   Address
0     1  ABC     72      Pune
1     2  EFG     68    Mumbai
2     3  LMN     55    Nashik
3     4  PQR     87   Solapur
4     5  XYZ     79  Parbhani

In [7]:
df2['Name'] # Methods to access the columns of DF. Can access multiple Columns at same time

0    ABC
1    EFG
2    LMN
3    PQR
4    XYZ
Name: Name, dtype: object

In [8]:
df2.Name # Other way to access individual columns. Series object holds only homogenious elements.
# It is a series object, having index and data in it. bottom, name of col. Series datatype having only one column. Df has multiple

0    ABC
1    EFG
2    LMN
3    PQR
4    XYZ
Name: Name, dtype: object

In [9]:
df2.iloc[0]#Way to access rows of DF. Returns the series object. Has heterogenious elements. So conerts it into string(obj)

Roll          1
Name        ABC
Marks        72
Address    Pune
Name: 0, dtype: object

In [10]:
type(df2) # It is of data type dataframe

pandas.core.frame.DataFrame

In [11]:
ser1 = df2.iloc[0]

In [12]:
type(ser1) # It is of data type series.

pandas.core.series.Series

In [13]:
type(ser1.Roll)  # (Series:- Stores data in homogenious form and returns individual element into its original datatype)

numpy.int64

In [14]:
df2[['Name', 'Marks']] # To access multiple column, we have to pass it as a list of list. Return Dataframe

  Name  Marks
0  ABC     72
1  EFG     68
2  LMN     55
3  PQR     87
4  XYZ     79

In [15]:
df2.iloc[0:2] # To accedss multiple rows, we have to use slicing method. Returns Dataframe

   Roll Name  Marks Address
0     1  ABC     72    Pune
1     2  EFG     68  Mumbai

In [16]:
# To access multiple rows and column at same time, used slicing and pass list of list to df name.

In [17]:
df2.iloc[1::2][['Name', 'Address']]

  Name  Address
1  EFG   Mumbai
3  PQR  Solapur

In [18]:
df2[['Name', 'Address']].iloc[1::2] # Both ways are possible

  Name  Address
1  EFG   Mumbai
3  PQR  Solapur

In [19]:
df2.shape # To get size of df

(5, 4)

# Create and Delete Cols and rows

In [20]:
df1

   Col1  Col2  Col3
0     7     3     6
1     4     9    10
2     7     8     3
3     7     3     3
4     4     2     5

In [21]:
df2

   Roll Name  Marks   Address
0     1  ABC     72      Pune
1     2  EFG     68    Mumbai
2     3  LMN     55    Nashik
3     4  PQR     87   Solapur
4     5  XYZ     79  Parbhani

In [22]:
# Lets consider the marks obtained by students are out of 120, to convert those marks into 100, we create new column.
df2['Percentage'] = df2['Marks']/120*100 # Or we can also pass the list of percentage obtained to the df2 new column

In [23]:
df2

   Roll Name  Marks   Address  Percentage
0     1  ABC     72      Pune   60.000000
1     2  EFG     68    Mumbai   56.666667
2     3  LMN     55    Nashik   45.833333
3     4  PQR     87   Solapur   72.500000
4     5  XYZ     79  Parbhani   65.833333

In [24]:
df2.append({'Roll':6, 'Name':'RST', 'Marks':88}, ignore_index=True)

   Roll Name  Marks   Address  Percentage
0     1  ABC     72      Pune   60.000000
1     2  EFG     68    Mumbai   56.666667
2     3  LMN     55    Nashik   45.833333
3     4  PQR     87   Solapur   72.500000
4     5  XYZ     79  Parbhani   65.833333
5     6  RST     88       NaN         NaN

In [25]:
# Here NaN means not anumber/ missing value

In [26]:
df2    # The changes made above will not reflect in original df as it changes original data.

   Roll Name  Marks   Address  Percentage
0     1  ABC     72      Pune   60.000000
1     2  EFG     68    Mumbai   56.666667
2     3  LMN     55    Nashik   45.833333
3     4  PQR     87   Solapur   72.500000
4     5  XYZ     79  Parbhani   65.833333

In [27]:
df2.append({'Roll':6, 'Name':'RST', 'Marks':88}, ignore_index=True )

   Roll Name  Marks   Address  Percentage
0     1  ABC     72      Pune   60.000000
1     2  EFG     68    Mumbai   56.666667
2     3  LMN     55    Nashik   45.833333
3     4  PQR     87   Solapur   72.500000
4     5  XYZ     79  Parbhani   65.833333
5     6  RST     88       NaN         NaN

In [28]:
#To make permentant change in df use another parameter inplace = True
df2.set_index('Roll', inplace=True) # It is used to make any column as a user defined index

In [29]:
df2 # df shows either user defined index(UDI) or default index

     Name  Marks   Address  Percentage
Roll
1     ABC     72      Pune   60.000000
2     EFG     68    Mumbai   56.666667
3     LMN     55    Nashik   45.833333
4     PQR     87   Solapur   72.500000
5     XYZ     79  Parbhani   65.833333

In [30]:
df2.loc[2] # df.loc:- it is used to access the rows on the basis of UDI

Name                EFG
Marks                68
Address          Mumbai
Percentage    56.666667
Name: 2, dtype: object

In [31]:
df2.iloc[1] # it will also give the same result

Name                EFG
Marks                68
Address          Mumbai
Percentage    56.666667
Name: 2, dtype: object

In [32]:
df2.loc[6] = ['RST', 75, 'Kolhapur', 69.5] # It is another way to add row in df by using UDI. Pass the list of row ele. as per col.sequence

In [33]:
df2

     Name  Marks   Address  Percentage
Roll
1     ABC     72      Pune   60.000000
2     EFG     68    Mumbai   56.666667
3     LMN     55    Nashik   45.833333
4     PQR     87   Solapur   72.500000
5     XYZ     79  Parbhani   65.833333
6     RST     75  Kolhapur   69.500000

In [34]:
df2.iloc[6] = [7,'RST', 75, 'Kolhapur', 69.5] # It is not possible to add row using default index.

IndexError: iloc cannot enlarge its target object

In [35]:
df2.loc[4] = ['AAA', 75, 'Kolhapur', 69.5] #But we can overwrite existing row by using this method
df2

     Name  Marks   Address  Percentage
Roll
1     ABC     72      Pune   60.000000
2     EFG     68    Mumbai   56.666667
3     LMN     55    Nashik   45.833333
4     AAA     75  Kolhapur   69.500000
5     XYZ     79  Parbhani   65.833333
6     RST     75  Kolhapur   69.500000

In [36]:
df2.set_index('Address', inplace = True) # We can have duplicate values in UDI

In [37]:
df2

         Name  Marks  Percentage
Address
Pune      ABC     72   60.000000
Mumbai    EFG     68   56.666667
Nashik    LMN     55   45.833333
Kolhapur  AAA     75   69.500000
Parbhani  XYZ     79   65.833333
Kolhapur  RST     75   69.500000

In [38]:
df2.loc['Kolhapur'] # for duplicate values, it will return all entries present in df

         Name  Marks  Percentage
Address
Kolhapur  AAA     75        69.5
Kolhapur  RST     75        69.5

In [39]:
df2.reset_index('Address', inplace= True) # It is sed to make UDI as a normal column
df2

    Address Name  Marks  Percentage
0      Pune  ABC     72   60.000000
1    Mumbai  EFG     68   56.666667
2    Nashik  LMN     55   45.833333
3  Kolhapur  AAA     75   69.500000
4  Parbhani  XYZ     79   65.833333
5  Kolhapur  RST     75   69.500000

In [40]:
# Note:- If we want to change UDI from one col. to another then 1st reset index to default and then change UDI.
# Or we may loose info. (Roll no info missing)

In [41]:
df2.drop('Percentage', axis =1) #It is used to delete the row or col. Explecitely mention axis = 0/1 to delete row or col.

    Address Name  Marks
0      Pune  ABC     72
1    Mumbai  EFG     68
2    Nashik  LMN     55
3  Kolhapur  AAA     75
4  Parbhani  XYZ     79
5  Kolhapur  RST     75

In [42]:
df2

    Address Name  Marks  Percentage
0      Pune  ABC     72   60.000000
1    Mumbai  EFG     68   56.666667
2    Nashik  LMN     55   45.833333
3  Kolhapur  AAA     75   69.500000
4  Parbhani  XYZ     79   65.833333
5  Kolhapur  RST     75   69.500000

In [43]:
df2.drop('Percentage', axis = 1, inplace=True) # To delete permenantly, use inplace = True

In [44]:
df2

    Address Name  Marks
0      Pune  ABC     72
1    Mumbai  EFG     68
2    Nashik  LMN     55
3  Kolhapur  AAA     75
4  Parbhani  XYZ     79
5  Kolhapur  RST     75

In [45]:
df2.append({'Name':'AAA', 'Marks':50, 'Address':'Pune'},ignore_index=True)

    Address Name  Marks
0      Pune  ABC     72
1    Mumbai  EFG     68
2    Nashik  LMN     55
3  Kolhapur  AAA     75
4  Parbhani  XYZ     79
5  Kolhapur  RST     75
6      Pune  AAA     50

In [46]:
df2.drop(5, axis = 0, inplace=True) # Delete row

In [47]:
df2

    Address Name  Marks
0      Pune  ABC     72
1    Mumbai  EFG     68
2    Nashik  LMN     55
3  Kolhapur  AAA     75
4  Parbhani  XYZ     79

In [48]:
df2.drop(1,inplace=True)
df2

    Address Name  Marks
0      Pune  ABC     72
2    Nashik  LMN     55
3  Kolhapur  AAA     75
4  Parbhani  XYZ     79

In [49]:
df = pd.read_excel('../Student Data.xlsx', sheet_name='XII') # Used to read external files in pandas. provide file type, path, sheet name

FileNotFoundError: [Errno 2] No such file or directory: '../Student Data.xlsx'

In [ ]:
df

In [ ]:
 df['Marks'].mean() # It has almost all functions of numply on series object. used to find average value

In [ ]:
b1 = df['Marks']>70 # Relatonal operator gives boolean array as o/p

In [50]:
b1

NameError: name 'b1' is not defined

In [51]:
df[b1] # we can pass this boolean array to filter the data of df. (filtering students who marks more than 70)

NameError: name 'df' is not defined

In [52]:
df

NameError: name 'df' is not defined

In [53]:
# Get the name of the topper of the class
t = df['Marks'].max()

NameError: name 'df' is not defined

In [54]:
t

NameError: name 't' is not defined

In [55]:
(df.set_index('Marks')).loc[t][['Name']] # 1st Mehod

NameError: name 'df' is not defined

In [56]:
b1 = (df['Marks'] == t)

NameError: name 'df' is not defined

In [57]:
df[b1]['Name'] # Another Method

NameError: name 'df' is not defined

In [58]:
df[df['Marks'] == (df['Marks'].max())]['Name']

NameError: name 'df' is not defined

In [59]:
# Average marks of students from pune

In [60]:
b2 = (df['Address'] == 'Pune')
b2

NameError: name 'df' is not defined

In [61]:
(df[b2]['Marks']).mean()

NameError: name 'df' is not defined

In [62]:
(df[df['Address'] == 'Pune']['Marks']).mean()

NameError: name 'df' is not defined

In [63]:
df

NameError: name 'df' is not defined

# Series Functions

In [64]:
df.head() # Used to show first few (5) records of df

NameError: name 'df' is not defined

In [65]:
df.tail() # Used to show last few (5) records of df

NameError: name 'df' is not defined

In [66]:
df['Address'].unique() # Used to get unique values of the col. of df

NameError: name 'df' is not defined

In [67]:
df['Address'].nunique()  # Used to get count of unique values of the col. of df/ length of array

NameError: name 'df' is not defined

In [68]:
df['Address'].value_counts() #Used to get occurance unique values in column of df

NameError: name 'df' is not defined

In [69]:
# Generate new column of city codes

In [70]:
def get_code(city):
    return city[:2]

In [71]:
list_code = []
for i in df['Address']:
    list_code.append(get_code(i))
print(list_code)

NameError: name 'df' is not defined

In [72]:
# df['City_Code'] = list_code

In [73]:
# .apply():- Used to apply any function on the column of df. Need to pass only function name to the apply function
df['City_code'] = df['Address'].apply(get_code) #Need to provide the relation bet. existing col and new col through fun name

NameError: name 'df' is not defined

In [74]:
df

NameError: name 'df' is not defined

In [75]:
df['Address'].apply(lambda X:X[:2]) # Instead of defining seperatefunction, we can write lambda function for the same

NameError: name 'df' is not defined

# Groupby

In [76]:
# To get the average marks of students from every city
df[df['Address'] == 'Pune']['Marks'].mean()

NameError: name 'df' is not defined

In [77]:
df[df['Address'] == 'Mumbai']['Marks'].mean()

NameError: name 'df' is not defined

In [78]:
df[df['Address'] == 'Nashik']['Marks'].mean() # This has to be done for every city. Instead we can use group by function.

NameError: name 'df' is not defined

In [79]:
#In groupby we have to provide 3 parameters- 1)On which basis group is to be formed 2) Which aggregate funct. is to be used
# 3) Which column we want as a result

In [80]:
df.groupby('Address').mean()['Marks'] # 1) 'Address' 2) mean() 3) 'Marks'

NameError: name 'df' is not defined

 # Merge/ Concatinate DataFrames

In [81]:
df1 = pd.DataFrame(data = np.random.randint(0,26,(5,4)), columns= ['A', 'B', 'C', 'D'])
df2 = pd.DataFrame(data = np.random.randint(0,26,(2,4)), columns= ['A', 'B', 'C', 'D'])
df3 = pd.DataFrame(data = np.random.randint(0,26,(5,3)), columns= ['X','Y', 'Z'])

In [82]:
df1

    A   B   C   D
0   1   3  25  14
1  20  22  12  18
2   6  25  12  19
3  25  21  13   2
4  24  17  18  18

In [83]:
df2

   A   B   C   D
0  6  10  24  16
1  4  10   1  18

In [84]:
df3

    X   Y   Z
0  22  20   3
1  23  12  17
2  18  13   3
3  21  15   5
4  20   7  17

In [85]:
pd.concat([df1,df2], axis =0) # Used to concatinate 2 df. axis=0 for row wise concat, axis01 for columnwise concat

    A   B   C   D
0   1   3  25  14
1  20  22  12  18
2   6  25  12  19
3  25  21  13   2
4  24  17  18  18
0   6  10  24  16
1   4  10   1  18

In [86]:
pd.concat([df1,df3], axis= 1) # pass the list of dataframes

    A   B   C   D   X   Y   Z
0   1   3  25  14  22  20   3
1  20  22  12  18  23  12  17
2   6  25  12  19  18  13   3
3  25  21  13   2  21  15   5
4  24  17  18  18  20   7  17

In [87]:
df_std = pd.read_excel('Student Data.xlsx', sheet_name='XII')
df_dep = pd.read_excel('Student Data.xlsx', sheet_name= 'Dept')

In [88]:
df_std

    Roll Name  Marks    Address  Dept_id         DOB
0      1  ABC     75       Pune        1  25-11-1998
1      2  EFG     67     Mumbai        1  12-05-1998
2      3  HIJ     91     Nashik        2  05-02-1999
3      4  KLM     72   Kolhapur        2  26-08-1998
4      5  NOP     54    Solapur        3  25-07-1998
5      6  QRS     88      Nagar        3  03-04-1999
6      7  TUV     59   Parbhani        1  07-01-1999
7      8  WXY     64  Aurangbad        3  15-10-1998
8      9  LMN     80       Pune        2  25-11-1998
9     10  PQR     79     Mumbai        1  11-10-1998
10    11  XYZ     90     Nashik        2  25-12-1998

In [89]:
df_dep

   Dept Dept_name  HOD
0     1      Mech  AAA
1     2        CS  BBB
2     3      Entc  CCC
3     4        IT  DDD
4     5     Civil  EEE

In [90]:
# Merge:- Used to merge/join the 2 df on the basis of common elements.
# Req:- 1) Names of df, 2) Names of cols. on basis of which merge to be done, 3) type of join

In [91]:
pd.merge(df_std, df_dep, left_on='Dept_id', right_on='Dept')

    Roll Name  Marks    Address  Dept_id         DOB  Dept Dept_name  HOD
0      1  ABC     75       Pune        1  25-11-1998     1      Mech  AAA
1      2  EFG     67     Mumbai        1  12-05-1998     1      Mech  AAA
2      7  TUV     59   Parbhani        1  07-01-1999     1      Mech  AAA
3     10  PQR     79     Mumbai        1  11-10-1998     1      Mech  AAA
4      3  HIJ     91     Nashik        2  05-02-1999     2        CS  BBB
5      4  KLM     72   Kolhapur        2  26-08-1998     2        CS  BBB
6      9  LMN     80       Pune        2  25-11-1998     2        CS  BBB
7     11  XYZ     90     Nashik        2  25-12-1998     2        CS  BBB
8      5  NOP     54    Solapur        3  25-07-1998     3      Entc  CCC
9      6  QRS     88      Nagar        3  03-04-1999     3      Entc  CCC
10     8  WXY     64  Aurangbad        3  15-10-1998     3      Entc  CCC

In [92]:
df_std.join(df_dep) # Another way

    Roll Name  Marks    Address  Dept_id         DOB  Dept Dept_name  HOD
0      1  ABC     75       Pune        1  25-11-1998   1.0      Mech  AAA
1      2  EFG     67     Mumbai        1  12-05-1998   2.0        CS  BBB
2      3  HIJ     91     Nashik        2  05-02-1999   3.0      Entc  CCC
3      4  KLM     72   Kolhapur        2  26-08-1998   4.0        IT  DDD
4      5  NOP     54    Solapur        3  25-07-1998   5.0     Civil  EEE
5      6  QRS     88      Nagar        3  03-04-1999   NaN       NaN  NaN
6      7  TUV     59   Parbhani        1  07-01-1999   NaN       NaN  NaN
7      8  WXY     64  Aurangbad        3  15-10-1998   NaN       NaN  NaN
8      9  LMN     80       Pune        2  25-11-1998   NaN       NaN  NaN
9     10  PQR     79     Mumbai        1  11-10-1998   NaN       NaN  NaN
10    11  XYZ     90     Nashik        2  25-12-1998   NaN       NaN  NaN

In [93]:
df_std.sort_values('Marks') # Used to sort the values in the column provided on rows. we can define criteria for sorting

    Roll Name  Marks    Address  Dept_id         DOB
4      5  NOP     54    Solapur        3  25-07-1998
6      7  TUV     59   Parbhani        1  07-01-1999
7      8  WXY     64  Aurangbad        3  15-10-1998
1      2  EFG     67     Mumbai        1  12-05-1998
3      4  KLM     72   Kolhapur        2  26-08-1998
0      1  ABC     75       Pune        1  25-11-1998
9     10  PQR     79     Mumbai        1  11-10-1998
8      9  LMN     80       Pune        2  25-11-1998
5      6  QRS     88      Nagar        3  03-04-1999
10    11  XYZ     90     Nashik        2  25-12-1998
2      3  HIJ     91     Nashik        2  05-02-1999

In [94]:
df_std.sort_values(['Marks', 'Address'], ascending=False) # sort in discending order. 
# If 2 values are same then we can provide list of col. for next sort axis = 0 for row sort and axis = 1 for col. sort

    Roll Name  Marks    Address  Dept_id         DOB
2      3  HIJ     91     Nashik        2  05-02-1999
10    11  XYZ     90     Nashik        2  25-12-1998
5      6  QRS     88      Nagar        3  03-04-1999
8      9  LMN     80       Pune        2  25-11-1998
9     10  PQR     79     Mumbai        1  11-10-1998
0      1  ABC     75       Pune        1  25-11-1998
3      4  KLM     72   Kolhapur        2  26-08-1998
1      2  EFG     67     Mumbai        1  12-05-1998
7      8  WXY     64  Aurangbad        3  15-10-1998
6      7  TUV     59   Parbhani        1  07-01-1999
4      5  NOP     54    Solapur        3  25-07-1998

In [95]:
df_std # For permenant change keep inplace = True

    Roll Name  Marks    Address  Dept_id         DOB
0      1  ABC     75       Pune        1  25-11-1998
1      2  EFG     67     Mumbai        1  12-05-1998
2      3  HIJ     91     Nashik        2  05-02-1999
3      4  KLM     72   Kolhapur        2  26-08-1998
4      5  NOP     54    Solapur        3  25-07-1998
5      6  QRS     88      Nagar        3  03-04-1999
6      7  TUV     59   Parbhani        1  07-01-1999
7      8  WXY     64  Aurangbad        3  15-10-1998
8      9  LMN     80       Pune        2  25-11-1998
9     10  PQR     79     Mumbai        1  11-10-1998
10    11  XYZ     90     Nashik        2  25-12-1998

In [96]:
df_std = pd.read_excel('Student Data.xlsx', sheet_name='XII')

In [97]:
df_std

    Roll Name  Marks    Address  Dept_id         DOB
0      1  ABC     75       Pune        1  25-11-1998
1      2  EFG     67     Mumbai        1  12-05-1998
2      3  HIJ     91     Nashik        2  05-02-1999
3      4  KLM     72   Kolhapur        2  26-08-1998
4      5  NOP     54    Solapur        3  25-07-1998
5      6  QRS     88      Nagar        3  03-04-1999
6      7  TUV     59   Parbhani        1  07-01-1999
7      8  WXY     64  Aurangbad        3  15-10-1998
8      9  LMN     80       Pune        2  25-11-1998
9     10  PQR     79     Mumbai        1  11-10-1998
10    11  XYZ     90     Nashik        2  25-12-1998

In [98]:
df_std.info() # here, DOB is in text format. It is difficult to sort student data on DOB in text format

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Roll     11 non-null     int64
 1   Name     11 non-null     object
 2   Marks    11 non-null     int64
 3   Address  11 non-null     object
 4   Dept_id  11 non-null     int64
 5   DOB      11 non-null     object
dtypes: int64(3), object(3)
memory usage: 656.0+ bytes

In [99]:
ser1 = pd.to_datetime(df_std['DOB']) # It converts the text format date into datetime format
ser1

0    1998-11-25
1    1998-12-05
2    1999-05-02
3    1998-08-26
4    1998-07-25
5    1999-03-04
6    1999-07-01
7    1998-10-15
8    1998-11-25
9    1998-11-10
10   1998-12-25
Name: DOB, dtype: datetime64[ns]

In [100]:
ser1.dt.day # to get date

0     25
1      5
2      2
3     26
4     25
5      4
6      1
7     15
8     25
9     10
10    25
Name: DOB, dtype: int64

In [101]:
ser1.dt.day_name() # to get day name of week

0     Wednesday
1      Saturday
2        Sunday
3     Wednesday
4      Saturday
5      Thursday
6      Thursday
7      Thursday
8     Wednesday
9       Tuesday
10       Friday
Name: DOB, dtype: object

In [102]:
ser1.dt.month_name() # to get day name of month

0     November
1     December
2          May
3       August
4         July
5        March
6         July
7      October
8     November
9     November
10    December
Name: DOB, dtype: object

In [103]:
ser1.sort_values() # for date wise sorting

4    1998-07-25
3    1998-08-26
7    1998-10-15
9    1998-11-10
0    1998-11-25
8    1998-11-25
1    1998-12-05
10   1998-12-25
5    1999-03-04
2    1999-05-02
6    1999-07-01
Name: DOB, dtype: datetime64[ns]

In [104]:
df_std['DOB_formated'] = ser1

In [105]:
df_std

    Roll Name  Marks    Address  Dept_id         DOB DOB_formated
0      1  ABC     75       Pune        1  25-11-1998   1998-11-25
1      2  EFG     67     Mumbai        1  12-05-1998   1998-12-05
2      3  HIJ     91     Nashik        2  05-02-1999   1999-05-02
3      4  KLM     72   Kolhapur        2  26-08-1998   1998-08-26
4      5  NOP     54    Solapur        3  25-07-1998   1998-07-25
5      6  QRS     88      Nagar        3  03-04-1999   1999-03-04
6      7  TUV     59   Parbhani        1  07-01-1999   1999-07-01
7      8  WXY     64  Aurangbad        3  15-10-1998   1998-10-15
8      9  LMN     80       Pune        2  25-11-1998   1998-11-25
9     10  PQR     79     Mumbai        1  11-10-1998   1998-11-10
10    11  XYZ     90     Nashik        2  25-12-1998   1998-12-25

In [106]:
df_std.sort_values('DOB_formated') # sorting of students on the basis of DOB

    Roll Name  Marks    Address  Dept_id         DOB DOB_formated
4      5  NOP     54    Solapur        3  25-07-1998   1998-07-25
3      4  KLM     72   Kolhapur        2  26-08-1998   1998-08-26
7      8  WXY     64  Aurangbad        3  15-10-1998   1998-10-15
9     10  PQR     79     Mumbai        1  11-10-1998   1998-11-10
0      1  ABC     75       Pune        1  25-11-1998   1998-11-25
8      9  LMN     80       Pune        2  25-11-1998   1998-11-25
1      2  EFG     67     Mumbai        1  12-05-1998   1998-12-05
10    11  XYZ     90     Nashik        2  25-12-1998   1998-12-25
5      6  QRS     88      Nagar        3  03-04-1999   1999-03-04
2      3  HIJ     91     Nashik        2  05-02-1999   1999-05-02
6      7  TUV     59   Parbhani        1  07-01-1999   1999-07-01

# Salary Exercise

In [107]:
df = pd.read_csv('archive/Salaries.csv')

C:\Users\hp\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [108]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [109]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [110]:
df.isna() # Used to get missing data

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,False,False,False,False,False,False,True,False,False,False,True,False,True
1,False,False,False,False,False,False,True,False,False,False,True,False,True
2,False,False,False,False,False,False,True,False,False,False,True,False,True
3,False,False,False,False,False,False,True,False,False,False,True,False,True
4,False,False,False,False,False,False,True,False,False,False,True,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,False,False,False,False,False,False,False,False,False,False,True,False,False
148650,False,False,False,False,False,False,False,False,False,False,True,False,True
148651,False,False,False,False,False,False,False,False,False,False,True,False,True
148652,False,False,False,False,False,False,False,False,False,False,True,False,True
148653,False,False,False,False,False,False,False,False,False,False,True,False,False

In [111]:
df.isna().sum() # Used to get value of no of missing data

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

In [112]:
# What is the average basepay?
df['BasePay'].mean() # it is not possible as there are some missing values and all data is in the form of string

TypeError: unsupported operand type(s) for +: 'float' and 'str'

In [113]:
df['BasePay'] = df['BasePay'].apply(lambda X: str(X)) # Coverted all values of BasePay into string
df['BasePay']

0            167411.18
1            155966.02
2            212739.13
3              77916.0
4             134401.6
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148654, dtype: object

In [114]:
S1 = df['BasePay'].apply(lambda X: float(X) if X.replace('.','',1).isdigit() else 0.0) 
S1 # Here, we have converted all int and loat values into float and other values (like Nan or Not Provided) into 0

0         167411.18
1         155966.02
2         212739.13
3          77916.00
4         134401.60
            ...
148649         0.00
148650         0.00
148651         0.00
148652         0.00
148653         0.00
Name: BasePay, Length: 148654, dtype: float64

In [115]:
S1.mean()

66053.7357541188

In [116]:
# what is the Highest value of OvertimePay
df['OvertimePay'] = df['OvertimePay'].apply(lambda X: str(X))
df['OvertimePay'] # Used to convert all values of OvertimePay in string

0                  0.0
1            245131.88
2            106088.18
3             56120.71
4               9737.0
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: OvertimePay, Length: 148654, dtype: object

In [117]:
S2 = df['OvertimePay'].apply(lambda X: float(X) if X.replace('.','',1).isdigit() else 0.0) #1 is used to replace only 1 dot
S2 # here, we covert all strings of float and int values into float and other into 0.0

0              0.00
1         245131.88
2         106088.18
3          56120.71
4           9737.00
            ...
148649         0.00
148650         0.00
148651         0.00
148652         0.00
148653         0.00
Name: OvertimePay, Length: 148654, dtype: float64

In [118]:
df['OvertimePay'] = S2
S2.max()

245131.88

In [119]:
# What is the job title of 'JOSEPH DRISCOLL'
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle'].iloc[0]

'CAPTAIN, FIRE SUPPRESSION'

In [120]:
# How much 'JOSEPH DRISCOLL' make including Benefits?
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits'].iloc[0]

270324.91

In [121]:
# Who is the Highest paid person including Benefits?
df['EmployeeName'][df['TotalPayBenefits'] == df['TotalPayBenefits'].max()][0]

'NATHANIEL FORD'

In [122]:
# What is the name of lowest paid person including Benefits?
df['EmployeeName'][df['TotalPayBenefits'] == df['TotalPayBenefits'].min()].iloc[0]

'Joe Lopez'

In [123]:
# What was the average basic pay of all employees per year 2011-14?

In [124]:
df['BasePay'] =S1

In [125]:
df.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.433001
2013    68509.832156
2014    66557.437750
Name: BasePay, dtype: float64

In [126]:
# How many unique jobTitle are there?
df['JobTitle'].nunique()

2159

In [127]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,0.00,0.00,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,0.00,0.00,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,0.00,0.00,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [128]:
# What are top 5 most common job titles?
df['JobTitle'].value_counts()[:5]

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [129]:
# How many job titles are represented by only one person in 2013?

In [130]:
df1 = df[['JobTitle', 'Year']].value_counts() == 1

In [131]:
(df[df['Year'] == 2013]['JobTitle'].value_counts() == 1).value_counts().iloc[1]

202

In [132]:
(df[df['Year'] == 2013]['JobTitle'].value_counts() == 1).sum()

202

In [133]:
# How many people have 'Chief' word in their job title?

In [134]:
lambda X:'CHIEF' in X.upper().split()

In [135]:
(df['JobTitle'].apply(lambda X:'CHIEF' in X.upper().split())).sum()

477